DATA_FILE_PATH = "data.xlsx"  # Имя файла Excel с данными

# API-ключ для AdsPower
API_KEY = ""  # Вставьте свой собственный api(Вкладка API -> API Key Generade)

# Версия ChromeDriver
CHROME_DRIVER_VERSION = "133.0.6943.99"  # Укажите версию у ваших браузеров

# Настройки профилей
TOTAL_PROFILES = 100  # Общее количество профилей
PROFILES_PER_BATCH = 10  # Количество профилей в пачке

PROFILE_DELAY_MIN = 10  # Минимальная задержка между профилями в секундах
PROFILE_DELAY_MAX = 30  # Максимальная задержка между профилями в секундах

MESSAGE_DELAY_MIN = 55  # Минимальная задержка между сообщениями в секундах
MESSAGE_DELAY_MAX = 65  # Максимальная задержка между сообщениями в секундах

MESSAGE_MIN = 15  # Минимальное количество отправленных сообщений 1 аккаунтом
MESSAGE_MAX = 25  # Максимальное количество отправленных сообщений 1 аккаунтом

SENDING_SAME_MESSAGE = 200  # Смена текста каждые 200 сообщений
